{
    "header": {
        "portfolio":"Portfolio",
        "about":"SOBRE MÍ",
        "skills":"HABILIDADES",
        "projects":"PROYECTOS",
        "contact":"CONTACTO",
        "projectsBtn":"Ver proyectos",
        "otherProjectsBtn":"Ver otros proyectos"
    },
    "aboutme":{
        "title": "Sobre Mí",
        "paragraph1": "Hola, soy Agustín Mendez, un joven programador backend apasionado por el código y la resolución de problemas lógicos complejos. Me esfuerzo por abordar cada tarea con gran dedicación y análisis para encontrar soluciones óptimas. Asimismo, me considero una persona organizada y responsable, lo cual se traslada a mi forma de trabajar, buscando continuamente la manera más prolija y eficiente de resolver los desafíos que se presentan.",
        "paragraph2": "Me gradué en 2022 de la Escuela Técnica 32 \"General José de San Martín\" con orientación en computación, donde inicié mi camino en la programación y la tecnología. Actualmente, estoy cursando la carrera de \"Tecnología Digital\" en la Universidad Don Torcuato Di Tella, para la cual cuento con una beca completa. Además, trabajo a jornada parcial en Salesforce, especializándome en el desarrollo backend empleando el lenguaje Apex.",
        "paragraph3": "Mi objetivo es seguir creciendo como profesional en el área de backend, adquiriendo conocimientos más profundos y especializados con el fin de consolidarme como un experto en el sector."
    },
    "skills":{
        "title":"Mis Habilidades",
        "technologies":"Tecnologías",
        "releaseTools":"Release Tools",
        "languages":"Idiomas"
    },
    "projects":{
        "title":"Mis Proyectos"
    },
    "contact":{
        "title":"¡Contáctame!",
        "subtitle": "Medios de contacto"
    },
    "sf-fieldsdinamicos":{
        "title":"Sistema de Campos Dinámicos",
        "description": "Desarrollo pensado para una estructura de proyecto que necesite un sistema dinámico en el cual se puedan modificar los objetos y campos que se utilizan sin tener que modificar el código fuente. Este diseño se implementó en varios proyectos de Salesforce que requerían cumplir estas condiciones. <br> A continuación se muestra una parte del código desarrollado:",
        "item1": "Listado de objetos",
        "body1": "Dada una lista de objetos donde se buscarán los datos y los nombres de sus correspondientes campos, se recorre cada objeto y cada serie de campos (sus lookups se respetan utilizando puntos, por ejemplo: Account.PrimaryContact.LastName). Para cada campo, se resuelve la búsqueda mediante la función recursiva getRelationField.",
        "item2": "Función recursiva getRelationField",
        "body2": "Dado un objeto y un campo que puede tener tantos lookups como se desee, esta función recursiva obtiene el campo del objeto y lo devuelve. Para ello, en cada vuelta de la recursión se obtiene el lookup siguiente hasta llegar al final, donde se devuelve el dato esperado. <br>En caso de no ser encontrado, devuelve nulo."
    }
}